高等数学（下）.org
* 高等数学下

** 微分方程
*** 概念
    - 微分方程解中未知数的个数与方程的阶数相同
*** 可分离变量的微分方程
    * 作业：7-1 4，7 
* 期末复习

** 向量代数与空间解析几何
*** 空间平面方程
    * 概念：特殊的曲面，点的几何轨迹
    * 点法式
    * 一般式
      * A=0 法向量垂直与x轴，平面平行于x轴。
      * A=0, B=0 平面平行于XOY平面。
    * 截距式
    * 两平面夹角
*** 空间直线方程
    * 概念：两空间平面的交线
    * 点向式方程
      * 直线上一点构成的向量与方向向量平行，对应系数成比例。
      * 方面向量与两平面的法向量都垂直，叉乘即可。
    * 参数方程
    * 两直线夹角
    * 平面与直线夹角（正弦）
*** 曲线与方程
    * 概念：点在空间中的运动几何轨迹
    * 球面方程
    * 旋转曲面：旋转轴变量不变，另一个变量变为点到旋转轴的距离。正负根号下平方和。
    * 柱面：母线平行于下缺少的变量轴，准线为平面上的曲线。
    * 二次曲面：空间中三元二次方程表示的曲面
      * 椭圆锥面
** 多元函数微分及其定义
*** 多元函数基本概念
    * 聚点：点的去心领域总包含区域的内容（无论区域开闭，聚点的范围都是区域内部加边界）
*** 多元函数连续性
    * 函数在某点的极限等于在该点的函数值则连续 或 自变量的增量都趋于零时函数的增量为0则连续。
    * 判断步骤：首先极限存在，再判断第一点。
    * 多元初等函数在其定义区域内都是连续的。
    * 连续点求极限，直接带入。
    * 性质：有界性最值性，界值定理
*** 偏导数
    * 偏导数针对多元函数
    * 偏导数是在某一个变量方向上的变化率
    * 求解：将另一个变量当作常数，求导数 
*** 高阶偏导数
    * 在连续的前提下，混合偏导数结果一样，与求偏导数的次序无关。
*** 全微分
    * 多元函数的全微分公式：dz = AΔx + BΔy + o(ρ)
    * 可微一定连续
    * 可微偏导数一定存在, 所以dz = fx(x,y)Δx + fy(x,y)Δy + o(ρ)
    * 偏导数连续是可微分的充分条件
*** 多元复合函数的求导法则
    * 多元套一元
    * 多元套多元
    * 一元套多元
    * 抽象复合函数求偏导数
*** 隐函数的求导法则
*** 多元函数微分学的几何应用
*** 方向导数与梯度
    * 方向导数等于梯度点乘l的单位向量
    * 梯度：函数变化最快的方向
    * 梯度的几何含义：空间曲面在某点处的法向量。 

** 重积分
*** 二重积分
    * 化为两次定积分计算
*** 计算方法
    * 利用直角坐标计算
      * X型区域：先y后x
      * Y型区域：先x后y
    * 改变积分次序，可以避免无法求解的二重积分
    * 利用极坐标计算圆弧的二重积分
      * 面积元素：r.dr.dθ = dx.dy(r.dθ是弧长)
      * 积分次序：先对r后对θ 

** 曲线积分与曲面积分
*** 对弧长的曲面积分
    * 几何意义：曲线下方柱面的面积
    * 计算：化为定积分计算 ∫Lf(x,y).ds
      * 参数方程：ds = √φ'^2(t) + ψ'^2(t) . dt
      * 极坐标方程：ds = √r^2(θ) + r'^2(θ) . dθ
      * 直角坐标方程：ds = √1 + y'^2(x) . dx
    * 利用对称性求解
      * 被积函数的和可以分开积分
      * 积分曲线具有对称性时，考察被积函数的奇偶性，可简化曲线积分
hello emacs this is kinney
